# BoundaryLinesIntersect Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..BoundaryLinesIntersect Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Boundary lines intersect.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BoundaryLinesIntersect { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryLinesIntersect As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BoundaryLinesIntersect {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace